{
    "Electrical fires": {
        "A": "اخراج جميع من في مبني او منزل واتصال بي مطافي والاسعاف فورا ",
        "B": "عدم استخدام الماء في إطفاء حرائق الكهرباء",
        "C": "العثور على الجهاز الذي تسبب في  الحريق الكهربائي،  فصل التيار عنه على الفور ",
        "D": "إذا كانت النار المشتعلة بسيطة  يمكنك إخمادها عن طريق إزالة باستخدام الملابس أو من خلال بطانية ثقيلة يتم إلقائها على مصدر النار",
        "E": "استخدام طفايه حريق لحين وصول المطافي ",
        "F": "يجب إغلاق الباب حال المغادرة وذلك لاحتواء النار"
    },
    "Gasoline fires": {
        "A": "اتصل بالطوارئ واطلب المساعدة الطبية على الفور",
        "B": "حذر الآخرين في المنطقة وحثهم على الابتعاد.",
        "C": "لا تستخدم الماء لإطفاء حريق البنزين، لأنه يمكن أن يزيد من انتشار اللهب",
        "D": "استخدم وسائل إطفاء مناسبة مثل الرغوة الكيميائية الخاصة بإطفاء حرائق السوائل القابلة للاشتعال",
        "E": "استخدم جهاز إطفاء الحريق إذا كان متاحًا وكان يستخدم نوعًا مناسبًا من وسائل الإطفاء",
        "F": "استخدام طفاية حريق ",
        "G": "إذا كنت تستخدم بطانية إطفاء، ضعها بعناية فوق اللهب لإخماد الحريق",
        "H": "قم بتجنب إدخال الهواء أو توفير الأكسجين للحريق، حيث يمكن أن يزيد هذا من شدة اللهب",
        "I": "ابتعد عن منطقة الحريق بأمان. حاول الابتعاد على بعد مسافة آمنة لتجنب التعرض للحرارة الشديدة والدخان الضار",
        "J": "إذا كان هناك رياح، توجه بها لتجنب انتشار الدخان واللهب",
        "K": "تجنب العودة إلى مكان الحريق حتى بعد إطفائه لتجنب الخطر",
        "L": "تأكد من أنك في مكان آمن وحافظ على سلامتك الشخصية"
    },
    "Oil fires": {
        "A": "اتصل بالطوارئ واطلب المساعدة الطبية على الفور",
        "B": "حذر الآخرين في المنطقة وحثهم على الابتعاد.",
        "C": "لا تستخدم الماء لإطفاء حريق البنزين، لأنه يمكن أن يزيد من انتشار اللهب",
        "D": "استخدم وسائل إطفاء مناسبة مثل الرغوة الكيميائية الخاصة بإطفاء حرائق السوائل القابلة للاشتعال",
        "E": "استخدم جهاز إطفاء الحريق إذا كان متاحًا وكان يستخدم نوعًا مناسبًا من وسائل الإطفاء",
        "F": "استخدام طفاية حريق ",
        "G": "إذا كنت تستخدم بطانية إطفاء، ضعها بعناية فوق اللهب لإخماد الحريق",
        "H": "قم بتجنب إدخال الهواء أو توفير الأكسجين للحريق، حيث يمكن أن يزيد هذا من شدة اللهب",
        "I": "ابتعد عن منطقة الحريق بأمان. حاول الابتعاد على بعد مسافة آمنة لتجنب التعرض للحرارة الشديدة والدخان الضار",
        "J": "إذا كان هناك رياح، توجه بها لتجنب انتشار الدخان واللهب",
        "K": "تجنب العودة إلى مكان الحريق حتى بعد إطفائه لتجنب الخطر",
        "L": "تأكد من أنك في مكان آمن وحافظ على سلامتك الشخصية"
    },
    "Chemical fires": {
        "A": "ارتدِ القفازات  أزل المواد الكيميائية الجافة ",
        "B": "رمي اي شي ملامس لمده الكميائي",
        "C": "تخلص من المواد الكيميائية عن طريق الشطف بالماء لمدة 20 دقيقة على الأقل تحت الدش . واحرص على أن تحمي عينيك من التلوث الكيميائي",
        "D": "ضع ضمادة طبيه  على الحرق. احرص على تغطية. ولفها على نحو فضفاض لتجنب الضغط على الجلد المحروق.",
        "E": "إذا استمر شعورك بالحرقان، فاشطف المنطقة المصابة مرة أخرى لبضع دقائق.",
        "F": "الذهاب الي  اقرب مستشفي "
    },
    "Drowning": {
        "A": "استدعاء الإسعاف أو اتصل بالطوارئ",
        "B": "إذا كنت في مكان آمن ويمكنك الوصول إليه، قم بسحب الشخص المصاب بسرعة إلى مكان آمن",
        "C": "تجنب الدخول في المياه إذا كانت هناك خطورة على سلامتك و انتظر شخص مختص ",
        "D": "تحقق من وعي الشخص المصاب. اطلب منه أن يتكلم أو أن يُظهِر علامات وعي، مثل الحركة أو الاستجابة للمؤثرات الخارجية",
        "E": "إذا كان الشخص لا يتنفس، قم ببدء إجراءات الإنعاش القلبي الرئوي (CPR) إذا كنت مدربًا عليه",
        "F": "إذا كنت غير مدرب على إجراءات الإنعاش، قم بضغط على الصدر بمعدل 100-120 ضغطة في الدقيقة، مع تقديم ضغط بعمق حوالي 5 سم (2 بوصة)",
        "G": " كان الشخص يتنفس، قم بتوجيهه إلى وضعية الجانب للتخلص من الماء المتبقي في الرئتين",
        "H": "غطِ الشخص ببطانية أو ملابس جافة للمساعدة في الحفاظ على الحرارة الجسدية",
        "I": "بمجرد إجراء الإسعافات الأولية، قدم الشخص المصاب للرعاية الطبية في أسرع وقت ممكن",
        "J": "مهم جداً أن يتم توفير الإسعافات الأولية من قبل أشخاص مدربين على هذه العمليات. في حالة الغرق، يمكن أن تكون الاستجابة السريعة حاسمة لزيادة فرص النجاة والتعافي"
    },
    "Food poisoning": {
        "A": "من الضروري الاستراحة وتجنب النشاط الشاق للمساعدة في تقوية الجسم والتعافي",
        "B": "شرب الكثير من السوائل يساعد في تجنب الجفاف وتعزيز عملية التخلص من السموم",
        "C": "تجنب تناول الأطعمة الصعبة أو الصلبة التي يمكن أن تجعل الوضع أسوأ",
        "D": "يمكن استخدام بعض العلاجات الطبيعية مثل شرب مغلي الزنجبيل لتهدئة المعدة",
        "E": "إذا استمرت الأعراض أو تفاقمت، يجب عليك الاتصال بالطبيب. في بعض الحالات، قد يكون من الضروري تلقي العناية الطبية",
        "F": "يجب تجنب تناول أي أدوية دون استشارة الطبيب، إلا إذا كان هناك توصية خاصة",
        "G": "إذا كنت قادرًا على تحديد نوع الطعام أو المشروب الذي قد تسبب في التسمم، فقد يكون ذلك مفيدًا لتجنب تناوله في المستقبل وللإبلاغ عن الحالة للسلطات الصحية",
        "K": "يجب عليك تجنب التواصل مع الأشخاص الآخرين قدر الإمكان لتجنب نقل العدوى"
    },
    "Snake bites": {
        "A": "اتصل بفريق الطوارئ على الفور",
        "B": "حاول البقاء هادئًا وتهدئة الشخص المصاب. الهدوء يساعد في تقليل سرعة انتشار السم",
        "C": "إذا كان ذلك آمنًا وممكنًا، حاول تحديد نوع الثعبان. يمكن أن يكون ذلك مفيدًا لتحديد العلاج الصحيح",
        "D": "قم بتقديم دعم للجزء المصاب وحد من حركة المنطقة المصابة. يمكن أن يساعد التقليل من الحركة في تقليل انتشار السم",
        "E": "قم بإزالة المجوهرات من المنطقة المصابة قبل أن تبدأ في الانتفاخ",
        "F": "إذا كان ذلك آمنًا، رفع المنطقة المصابة إلى أعلى، ولكن لا تضع الضغط الزائد على المنطقة",
        "G": "تجنب محاولة شفط السم بالفم. هذا لا يقلل من فعالية السم ويمكن أن يزيد من خطورة الإصابة",
        "H": "لا تقم بوضع الثلج على المنطقة المصابة. لا ينصح به لعلاج لدغات الثعابين",
        "I": "مراقبة الأعراض وتوجيه الشخص المصاب للجلوس أو الاستلقاء بموضع مريح",
        "J": "تذكر أنه يجب الحصول على الرعاية الطبية الفورية بمجرد حدوث لدغة الثعبان. لا تحاول علاج الدغة بمفردك، بل اعتمد على الفريق الطبي المحترف لتقديم العلاج اللازم وتقييم الحالة"
    },
    "Scorpion stings": {
        "A": "قم بالابتعاد عن مصدر اللسعة وتأكد من إزالة العقرب إذا كان لا يزال ملتصقًا بالجلد",
        "B": "احفظ العقرب إذا كان آمنًا للتعرف على نوعه",
        "C": "قم بغسل مكان اللسعة بالماء والصابون لتقليل فرص العدوى",
        "D": "يمكن تطبيق كيس ثلج أو ماء بارد على مكان اللسعة لتقليل الألم والتورم. ولكن تجنب وضع الثلج مباشرة على الجلد، استخدم قطعة قماش للف وسائل التبريد",
        "E": "قم بتثبيت المنطقة المصابة بواسطة شريط للحد من الحركة وتقليل انتشار السم",
        "F": "يمكن تناول مسكنات الألم التي تحتوي على الباراسيتامول أو الإيبوبروفين بناءً على توجيهات الطبيب",
        "G": "قم بمراقبة الأعراض. إذا كانت هناك أعراض خطيرة مثل صعوبة في التنفس أو انخفاض في ضغط الدم، فهذا يتطلب العناية الطبية الفورية",
        "H": " يجب على الشخص الذي تعرض للسعة العقرب البحث عن الرعاية الطبية على الفور. تكون لسعات العقارب قدرة على أن تكون سامة وتتطلب تقييمًا وعلاجًا متخصصين"
    },
    "Earthquake in the car": {
        "A": "ابحث عن مكان آمن للتوقف مثل مكان خالٍ من الأشجار أو المباني",
        "B": "تجنب التوقف تحت الأنفاق أو الكباري حيث يمكن أن تكون هناك انهيارات",
        "C": "تجنب التوقف تحت الكتل الكبيرة أو المباني المتهدمة حيث يمكن أن تكون هناك خطورة من الانهيار",
        "D": "قلل من السرعة تدريجيًا وابتعد عن حركات القيادة الحادة",
        "E": "تجنب الكباري العالية أو المناطق التي يمكن أن تكون عرضة للانهيار",
        "G": "انخرط في المركبة وحافظ على رأسك وعنقك في مكان آمن",
        "H": "تجنب الخروج من السيارة، حيث يمكن أن تكون هناك خطورة من السقوط الأشياء",
        "J": "تجنب التوقف في الأماكن المفتوحة حيث يمكن أن يتساقط الأشياء على السيارة",
        "K": "استمع إلى الأخبار عبر الراديو أو الهاتف لتلقي المعلومات حول الزلزال والتوجيهات الرسمية",
        "L": "بمجرد توقف الزلزال، تحقق من سلامة نفسك والآخرين، وقدم المساعدة إذا كنت في موقع يمكنك من ذلك"
    },
    "earthquake": {
        "During the earthquake": {
            "A": "انخرط على الأرض واستلقِ على يديك وركبتيك لتقليل فرص التعرض للإصابات",
            "B": "ابتعد عن النوافذ والأسطح الزجاجية، وأي شيء يمكن أن يسقط عليك",
            "C": "تجنب التحرك داخل المباني أثناء الزلزال، حيث يمكن أن يكون هناك خطر من السقوط.",
            "D": "إذا كنت قريبًا من طاولة قوية، اختبأ تحتها للحماية من السقوط الأشياء",
            "E": "تجنب استخدام السلالم أثناء الزلزال، لأنها قد تكون غير آمنة"
        },
        "After the earthquake": {
            "A": "تحقق من سلامة نفسك والأشخاص المحيطين بك.",
            "B": "ابقى في مكان آمن حتى يتضح أن الخطر قد انتهى تمامًا",
            "C": "تجنب الأماكن القريبة من المباني المتضررة أو الأسلاك الكهربائية المكسورة",
            "D": "قم بتقييم الأضرار في المبنى وتجنب دخول المباني التي تظهر عليها علامات تلف خطير",
            "E": "استمع للتقارير الإخبارية أو الإعلانات الرسمية لتلقي التوجيهات بشأن مواقع الإغاثة والتحذيرات.",
            "F": "قدم المساعدة للأشخاص الذين قد يحتاجون إلى عناية طبية",
            "G": "كن حذرًا من الاهتزازات الثانوية أو الهزات الارتدادية. انخرط في مكان آمن حتى تتوقف تمامً"
        }
    }
}